{
  "ticker": "MSFT",
  "filing_type": "10-Q",
  "year": 2022,
  "quarter": 2,
  "verification_results": {
    "total_raw_facts": 1433,
    "exact_matches": 1259,
    "name_only_matches": 174,
    "completeness_percentage": 100.0
  },
  "verification_output": [
    "=== Verification Results ===",
    "Raw XBRL JSON: sec_processed/tmp/sec_downloads/MSFT/10-Q/000156459022002324/_xbrl_raw.json",
    "LLM File: sec_processed/MSFT/MSFT_10-Q_2022_Q2_llm.txt",
    "----------------------------------------",
    "Total Raw XBRL Facts: 1433",
    "Total LLM Concepts: 1433",
    "Facts Matched (Exact): 1259",
    "Facts Matched (By Name Only): 174",
    "Facts Missing in LLM: 174",
    "Facts Still Missing After Name-Only Match: 0",
    "Facts with Value Mismatches: 0",
    "Extra Facts in LLM: 174",
    "----------------------------------------",
    "Completeness (Exact Match): 87.86%",
    "Completeness (Including Name-Only Matches): 100.00%",
    "",
    "=== Sample Extra Facts in LLM ===",
    "  us-gaap:ComprehensiveIncomeNoteTextBlock [Context: C_0000789019_20210701_20211231, Unit: ] = NOTE 16 — ACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS)The following table summarizes the changes in accumulated other comprehensive income (loss) by component:(In millions)Three Months EndedDecember 31,Six Months EndedDecember 31,2021202020212020DerivativesBalance, beginning of period$(17)$(34)$(19)$(38)Unrealized gains (losses), net of tax of$(3), $7, $(6), and $12(11)25(21)45Reclassification adjustments for (gains) losses included in other income (expense), net14(21)29(41)Tax expense (benefit) included in provision for income taxes(3)4(6)8Amounts reclassified from accumulated other comprehensive income (loss)11(17)23(33)Net change related to derivatives, net of tax of$0,$3, $0, and $408212Balance, end of period$(17)$(26)$(17)$(26)InvestmentsBalance, beginning of period$2,800$5,287$3,222$5,478Unrealized losses, net of tax of$(197), $(128),$(307), and $(178)(742)(477)(1,157)(665)Reclassification adjustments for gains included in other income (expense), net(1)(19)(10)(36)Tax expense included in provision for income taxes0428Amounts reclassified from accumulated other comprehensive income (loss)(1)(15)(8)(28)Net change related to investments, net of tax of$(197),$(132),$(309), and $(186)(743)(492)(1,165)(693)Cumulative effect of accounting changes00010Balance, end of period$2,057$4,795$2,057$4,795Translation Adjustments and OtherBalance, beginning of period$(1,500)$(2,143)$(1,381)$(2,254)Translation adjustments and other, net of tax of$0, $0,$0, and $(9)(103)741(222)852Balance, end of period$(1,603)$(1,402)$(1,603)$(1,402)Accumulated other comprehensive income, end of period$437$3,367$437$3,367",
    "  us-gaap:EarningsPerSharePolicyTextBlock [Context: C_0000789019_20210701_20211231, Unit: ] = Basic earnings per share (“EPS”) is computed based on the weighted average number of shares of common stock outstanding during the period. Diluted EPS is computed based on the weighted average number of shares of common stock plus the effect of dilutive potential common shares outstanding during the period using the treasury stock method. Dilutive potential common shares include outstanding stock options and stock awards.",
    "  us-gaap:EarningsPerShareTextBlock [Context: C_0000789019_20210701_20211231, Unit: ] = NOTE 2 — EARNINGS PER SHAREBasic earnings per share (“EPS”) is computed based on the weighted average number of shares of common stock outstanding during the period. Diluted EPS is computed based on the weighted average number of shares of common stock plus the effect of dilutive potential common shares outstanding during the period using the treasury stock method. Dilutive potential common shares include outstanding stock options and stock awards.The components of basic and diluted EPS were as follows:(In millions, except earnings per share)Three Months EndedDecember 31,Six Months EndedDecember 31,2021202020212020Net income available for common shareholders (A)$18,765$15,463$39,270$29,356Weighted average outstanding shares of common stock (B)7,5057,5557,5097,561Dilutive effect of stock-based awards50615266Common stock and common stock equivalents (C)7,5557,6167,5617,627Earnings Per ShareBasic (A/B)$2.50$2.05$5.23$3.88Diluted (A/C)$2.48$2.03$5.19$3.85Anti-dilutive stock-based awards excluded from the calculations of diluted EPS were immaterial during the periods presented.",
    "  us-gaap:IncomeTaxDisclosureTextBlock [Context: C_0000789019_20210701_20211231, Unit: ] = NOTE 11—INCOME TAXESEffective Tax RateOur effective tax rate was17% and16% for the three months ended December 31, 2021 and 2020, respectively, and9% and15% for the six months ended December 31, 2021 and 2020, respectively. The increase in our effective tax rate for the three months ended December 31, 2021 compared to the prior year was primarily due to changes in the mix of our income before income taxes between the U.S. and foreign countries and tax benefits from final Tax Cuts and Jobs Act regulations in fiscal year 2021, offset in part by an increase in tax benefits relating to stock-based compensation. The decrease in our effective tax rate for the six months ended December 31, 2021 compared to the prior year was primarily due to a $3.3billion net income tax benefit in the first quarter of fiscal year 2022 related to the transfer of intangible properties.In the first quarter of fiscal year 2022, we transferred certain intangible properties from our Puerto Rico subsidiary to the U.S. The transfer of intangible properties resulted in a $3.3billion net income tax benefit in the first quarter of fiscal year 2022, as the value of future U.S. tax deductions exceeds the current tax liability from the U.S. global intangible low-taxed income tax.Our effective tax rate was lower than the U.S. federal statutory rate for the three and six months ended December 31, 2021, primarily due to earnings taxed at lower rates in foreign jurisdictions resulting from producing and distributing our products and services through our foreign regional operations center in Ireland, tax benefits relating to stock-based compensation, and for the six months ended December 31, 2021, the net income tax benefit related to the transfer of intangible properties.Uncertain Tax PositionsAs of December 31, 2021 and June 30, 2021, unrecognized tax benefits and other income tax liabilities were $16.3billion and $15.9billion, respectively, and are included in long-term income taxes in our consolidated balance sheets.We settled a portion of the Internal Revenue Service (“IRS”) audit for tax years2004to2006in fiscal year 2011. In February 2012, the IRS withdrew its 2011 Revenue Agents Report related to unresolved issues for tax years 2004 to 2006 and reopened the audit phase of the examination. We also settled a portion of the IRS audit for tax years2007to2009in fiscal year 2016, and a portion of the IRS audit for tax years2010to2013in fiscal year 2018. In the second quarter of fiscal year 2021, we settled an additional portion of the IRS audits for tax years2004to2013and made a payment of $1.7billion, including tax and interest. We remain under audit for tax years2004to2017.As of December 31, 2021, the primary unresolved issues for the IRS audits relate to transfer pricing, which could have a material impact in our consolidated financial statements when the matters are resolved. We believe our allowances for income tax contingencies are adequate. We have not received a proposed assessment for the unresolved key transfer pricing issues and do not expect a final resolution of these issues in the next 12 months. Based on the information currently available, we do not anticipate a significant increase or decrease to our tax contingencies for these issues within the next 12 months.We are subject to income tax in many jurisdictions outside the U.S. Our operations in certain jurisdictions remain subject to examination for tax years1996to2021, some of which are currently under audit by local tax authorities. The resolution of each of these audits is not expected to be material to our consolidated financial statements.",
    "  us-gaap:IncomeTaxExaminationYearUnderExamination [Context: C_0000789019_us-gaapIncomeTaxAuthorityNameAxis_us-gaapInternalRevenueServiceIRSMember_us-gaapTaxPeriodAxis_us-gaapEarliestTaxYearMember_20100701_20110630, Unit: ] = 2004",
    "",
    "=== Concept Name Coverage ===",
    "Unique Concept Names in Raw: 349",
    "Unique Concept Names in LLM: 349",
    "Concept Names in Raw but not LLM: 0",
    "Concept Names in LLM but not Raw: 0"
  ],
  "exit_code": 0,
  "error_output": "2025-04-02 08:42:37,596 - INFO - Loaded 1550 facts from sec_processed/tmp/sec_downloads/MSFT/10-Q/000156459022002324/_xbrl_raw.json\n2025-04-02 08:42:37,597 - INFO - Loaded LLM file: sec_processed/MSFT/MSFT_10-Q_2022_Q2_llm.txt\n2025-04-02 08:42:37,603 - INFO - Parsed 1550 @CONCEPT blocks from LLM file.\n"
}